# -*- coding: utf-8 -*-
# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.


number = int(input('Введите число: '))
number = number+2
print('Ваше число +2:', number)

