# -*- coding: utf-8 -*-
# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран


a = 1
b = 2
print('Целые числа: a =',a, ', b =', b)

a ='abc'
b = 'cba'
print('Строка: a =',a, ', b =', b)

a = True
b = False
print('Булевы: a =',a, ', b =', b)

a = 3.14
b = 2.17
print('Вещественные: a =',a, ', b =', b)


c = int(input('Введите целое число: '))
print('Вы ввели целое число', c)

c = input('Введите строку: '))
print('Вы ввели строку:', c)
